# BindingMap Properties

---
The BindingMap type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the map is empty.(Inherited from DefinitionBindingMap)
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Item|  The get_Item method will get the binding item related to the input key.(Overrides DefinitionBindingMapItemDefinition)
| Size| Returns the number of bindings that are in the map.(Inherited from DefinitionBindingMap)
Top
#### Reference
BindingMap Class
Autodesk.Revit.DB Namespace